{
  "info": {
    "name": "Matt Evans",
    "title": "Developer & Graphic Designer",
    "contact": {
      "address": "20 Seaview Terrace, Swansea, SA1 6FE",
      "email": "matt.s.evans@outlook.com",
      "tel": "07488247986"
    },
    "links": {
      "Github": "github.com/mattkatt",
      "Codepen": "codepen.io/mk-mattevans",
      "LinkedIn": "linkedin.com/in/matt-evans-57934487"
    },
    "summary": "Front-End Developer with PHP and Full-Stack experience, coming from a graphic design background and with professional experience in both customer-service and technical roles. Highly adaptable, quick to learn, and able to juggle multiple tasks. A versatile creative with skills working as part of a team or individually on projects."
  },
  "skills": {
    "Web Development": [
      "HTML5, CSS (Sass, Less)",
      "Javascript (jQuery, Vue.js)",
      "PHP (Laravel, Drupal)",
      "OOP and SOLID principles",
      "MySQL",
      "Apache2/Nginx",
      "GIT version control (Github)",
      "API development (Postman)",
      "Release management (Ansible, CircleCI)"
    ],
    "Graphic/Communication Design": [
      "UI/UX",
      "Typography",
      "Layout Design",
      "Colour Theory",
      "Adobe Suite (Illustrator, Photoshop, InDesign)",
      "Artistic/Illustration",
      "Photography"
    ]
  },
  "experience": [
    {
      "date": "May 2017 - Present",
      "company": "UKDS",
      "location": "Bridgend, UK",
      "title": "Front-end Developer/Graphic Designer",
      "bio": "Role:\nResponsible for general upkeep and improvement of existing products, while designing\nand developing new projects at the request of the directors. Also responsible for all\ngraphic design aspects and needs of the group at an ad hoc basis.\nUKDS is part of a group of companies, and is responsible for the technical requirements\nof all other companies within the group. Group includes solicitors, accountants, datarecovery specialist, and social media management.\nProjects:\n- Vue Application: Developed new Vue.js/Laravel 7 applications for new arm of existing\nbusiness. Project included building two separate Vue.js applications, one using a\nNuxt.js server and the other on a LAMP-Stack, which interacted with a custom Laravel\n7 API server. Also involved utilising Progressive Web Application (PWA) technology,\ndeveloping with third-party APIs, and implementing CircleCI deployment.\n- WordPress Blog: Setup new WordPress blog site for local political entity. Involved\ncomplete design and several minor custom elements. Project received with tight\ndeadline, and completed within two weeks.\n- Multi-lingual Information Site: Created a single Laravel 6 site that could be deployed\nto separate servers, each of which hosted a diﬀerent language-based environment\nin diﬀerent countries. Project included full graphical design, language translation\nimplementation and Ansible script deployment.\n- Existing Site Rebuild/Redesign: Updated existing site to use Laravel 5 over previous\nSymphony build, along with new design. Implemented CMS-style application structure\nto allow simple content updates and integrated blog.\n- Data Recovery Partner Portal: Created and deployed LAMP-Stack Laravel 5 web\nportal for potential shop-partners to submit resold/referred recovery jobs. Project\nincluded tight deadline, with initial release within two weeks, and further development\nof additional features over six weeks.\n- Laravel Site w/ Payment Checkout: Designed and developed front-end of new\nLaravel 5 site, including integrated blog, multiple payment APIs (SagePay, GoCardless,)\nand custom invoice PDF generation.\nPersonal Accomplishments:\n- Reduced loading time of existing company websites from 7+ second to sub-3 seconds,\nreducing customer drop-oﬀ and improving Google search ranking.\n- Assisted senior developer in implementing Agile-methodology (Kanban) of sofware\ndevelopment across the team.\n- Mentored junior developer on both front and back-end development processes and\nbest practices."
    },
    {
      "date": "Nov 2015 - Dec 2016",
      "company": "Alphagraphics",
      "location": "New Brunswick, NJ",
      "title": "Bindary Operator",
      "bio": "Bindery operations included cutting, folding, and binding of printed materials. Other duties included cutting and mounting of large format signage, on-site installations, and maintaining and monitoring envelope printers and inserters. Responsibilities include maintaining the workshop floor and monitoring stock levels."
    },
    {
      "date": "June  2014 - July 2015",
      "company": "Gariel Screen Printing",
      "location": "West Deptford, NJ",
      "title": "Web Developer",
      "bio": "Update and redesigning the company website. This role included modernisation of the HTML to current web standards, as well as a complete graphical and layout redesign. Challenges included creating a design colour preview app from scratch, and being unable to alter the back-end PHP."
    },
    {
      "date": "April 2014 - July 2015",
      "company": "Gariel Screen Printing",
      "location": "West Deptford, NJ",
      "title": "Print Room Assistant",
      "bio": "Assisting in the day to day running of the screen printing workshop. Primary duties included maintaining, screening and burning silk screens for use in both manual and automatic printing machines. Other duties included maintaining back-room workshop, negative filing, and occasional print-room relief during busy periods."
    },
    {
      "date": "June 2013 - April 2019",
      "company": "Bunbury Magazine",
      "location": "Online",
      "title": "Layout Editor",
      "bio": "Creating and maintaining layouts and styling for Bunbury magazine. Managing colour themes and typeface, as well as creating typography, illustrations, and graphical assets as required."
    }
  ],
  "education": [
    {
      "date": "2020 (Ongoing)",
      "institution": "Udemy (Self-study)",
      "qualifications": [
        "Vue.js - The Complete Guide (Maxamillion Schwarzmuller)"
      ]
    },
    {
      "date": "2018",
      "institution": "Laracasts (Self-study)",
      "qualifications": [
        "Laravel 5.7 From Scratch (Jeffrey Way)"
      ]
    },
    {
      "date": "2013",
      "institution": "Codecademy (Self-study)",
      "qualifications": [
        "Introduction to JavaScript"
      ]
    },
    {
      "date": "2009-2011",
      "institution": "University of Wales Trinity St David, Swansea",
      "qualifications": [
        "Level 4 Diploma, Foundation Art and Design"
      ]
    },
    {
      "date": "2009",
      "institution": "CADCentre, Swansea",
      "qualifications": [
        "Level 3 Diploma, CAD NVQ",
        "Level 2 Diploma, ICT NVQ"
      ]
    },
    {
      "date": "2005-2008",
      "institution": "University of Wales Swansea, Swansea",
      "qualifications": [
        "Certificate of Education, Material Science and Engineering"
      ]
    }
  ],
  "interests": [
    "Creative writing",
    "Tabletop roleplaying",
    "Playing video games",
    "Reading fantasy and science fiction",
    "Listening to music and playing instruments (Piano, Bass)",
    "Collecting Lego",
    "Small arts and crafts",
    "Painting",
    "Physical/Computerised Logic Puzzles"
  ]
}